In [1]:
import pandas as pd
import numpy as np

In [2]:
data=pd.read_csv('50_Startups.csv')

# Regression with Decision Tree

In [3]:
data.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

In [4]:
data['State'].unique()

array(['New York', 'California', 'Florida'], dtype=object)

In [5]:
#get_dummies method changes categorical data to numerical data 
new_data=pd.get_dummies(data['State'])

In [6]:
new_data

    California  Florida  New York
0            0        0         1
1            1        0         0
2            0        1         0
3            0        0         1
4            0        1         0
5            0        0         1
6            1        0         0
7            0        1         0
8            0        0         1
9            1        0         0
10           0        1         0
11           1        0         0
12           0        1         0
13           1        0         0
14           0        1         0
15           0        0         1
16           1        0         0
17           0        0         1
18           0        1         0
19           0        0         1
20           1        0         0
21           0        0         1
22           0        1         0
23           0        1         0
24           0        0         1
25           1        0         0
26           0        1         0
27           0        0         1
28           0        1         0
29           0        0         1
30           0        1         0
31           0        0         1
32           1        0         0
33           0        1         0
34           1        0         0
35           0        0         1
36           0        1         0
37           1        0         0
38           0        0         1
39           1        0         0
40           1        0         0
41           0        1         0
42           1        0         0
43           0        0         1
44           1        0         0
45           0        0         1
46           0        1         0
47           1        0         0
48           0        0         1
49           1        0         0

In [7]:
new_data['R&D']=data['R&D Spend']

In [8]:
new_data['Admin']=data['Administration']

In [9]:
new_data['Market']=data['Marketing Spend']

In [10]:
new_data.head()

   California  Florida  New York        R&D      Admin     Market
0           0        0         1  165349.20  136897.80  471784.10
1           1        0         0  162597.70  151377.59  443898.53
2           0        1         0  153441.51  101145.55  407934.54
3           0        0         1  144372.41  118671.85  383199.62
4           0        1         0  142107.34   91391.77  366168.42

In [11]:
new_data.isnull().sum()

California    0
Florida       0
New York      0
R&D           0
Admin         0
Market        0
dtype: int64

In [12]:
features=new_data

In [13]:
label=data['Profit']

In [14]:
from sklearn.tree import DecisionTreeClassifier,DecisionTreeRegressor

In [33]:
reg=DecisionTreeRegressor(max_depth=6)

In [34]:
reg.fit(features,label)

DecisionTreeRegressor(criterion='mse', max_depth=6, max_features=None,
           max_leaf_nodes=None, min_impurity_decrease=0.0,
           min_impurity_split=None, min_samples_leaf=1,
           min_samples_split=2, min_weight_fraction_leaf=0.0,
           presort=False, random_state=None, splitter='best')

In [35]:
reg.score(features,label)

0.9997258932131855

In [25]:
reg.predict([[1,0,0,165349.20 ,136897.80 ,471784.10]])

array([184838.842])

In [26]:
from sklearn.metrics import r2_score

In [21]:
r2_score(reg.predict(features),label)

0.9975845049071068

# Classification with Decision Tree

In [36]:
data.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

In [37]:
features=data.drop(columns='State')

In [38]:
features.head()

   R&D Spend  Administration  Marketing Spend     Profit
0  165349.20       136897.80        471784.10  192261.83
1  162597.70       151377.59        443898.53  191792.06
2  153441.51       101145.55        407934.54  191050.39
3  144372.41       118671.85        383199.62  182901.99
4  142107.34        91391.77        366168.42  166187.94

In [39]:
label=(data['State'])

In [40]:
label.head()

0      New York
1    California
2       Florida
3      New York
4       Florida
Name: State, dtype: object

In [48]:
clss=DecisionTreeClassifier(max_depth=5)

In [49]:
clss.fit(features,label)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=5,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [50]:
clss.score(features,label)

0.7

In [51]:
clss.predict([[165349.20 ,136897.80 ,471784.10 ,192261.83]])

array(['New York'], dtype=object)